[{"exits":{"north":{"direction":0,"desc":"The Immortal Board Room can be seen to the north.","tags":[],"flag":0,"keyNum":-1,"roomId":1204}},"extra":{"tags":[],"desc":""},"id":1200,"name":"The Meeting Room Of The Gods","desc":"The meeting room is plain and very simple.  A circular table sits in the middle of the room, lit by some unseen light source.  There are many chairs around the table, all empty.  The Immortal Board Room is to the north.","zoneNum":12,"roomBitVector":"d","sectorType":0},{"exits":{"south":{"direction":2,"desc":"The Immortal Board Room can be seen to the south.","tags":[],"flag":0,"keyNum":-1,"roomId":1204}},"extra":{"tags":[],"desc":""},"id":1201,"name":"The Inn Of The Gods","desc":"The Inn of the Gods is a small room, holding only a shelf with many small precious stones on it.  When a God comes to rent his belongings, his essence is stored in the stones.  The Immortal Board Room is to the south.","zoneNum":12,"roomBitVector":"dj","sectorType":0},{"exits":{},"extra":{"tags":[],"desc":""},"id":1202,"name":"The Ice Box Of The Gods","desc":"The Ice Box is for little boys and girls that cannot play nice. Be good and maybe someone will come and get you.","zoneNum":12,"roomBitVector":"defh","sectorType":0},{"exits":{"west":{"direction":3,"desc":"The Immortal Board Room can be seen to the west.","tags":[],"flag":0,"keyNum":-1,"roomId":1204}},"extra":{"tags":[],"desc":""},"id":1203,"name":"The Gods' Mortal Board Room","desc":"Here the Gods have magically created an exact copy of the mortal board room.  Any God can easily post and read messages from the mortal board room without being seen by any mortals.  The Immortal Board Room is to the west.","zoneNum":12,"roomBitVector":"d","sectorType":0},{"exits":{"north":{"direction":0,"desc":"The Gods' Inn can be seen just to the north.","tags":[],"flag":0,"keyNum":-1,"roomId":1201},"east":{"direction":1,"desc":"The Mortal Board Room can be seen just to the east.","tags":[],"flag":0,"keyNum":-1,"roomId":1203},"south":{"direction":2,"desc":"The Gods' Meeting Room is located to the south.","tags":[],"flag":0,"keyNum":-1,"roomId":1200},"west":{"direction":3,"desc":"The Gods' Post Office is just to the west.","tags":[],"flag":0,"keyNum":-1,"roomId":1205},"up":{"direction":4,"desc":"There is a small stair in the corner leading up to the social room of","tags":[],"flag":null,"keyNum":null,"roomId":null},"down":{"direction":5,"desc":"You see the hustle and bustle of the Temple of Midgaard at the bottom of","tags":[],"flag":null,"keyNum":null,"roomId":null}},"extra":{"tags":[],"desc":""},"id":1204,"name":"The Immortal Board Room","desc":"The main hang out of the Gods, the Immortal Board Room is the place to be.  Gods exchange messages here most every day.  The mortal board room is to the east and the meeting room for the gods is to the south.  To the north is the Gods' Inn and to the west is a post office for Gods.  There is a large staircase leading down to the main temple in the city of Midgaard.  In the northeast corner you spot a small staircase leading upwards.","zoneNum":12,"roomBitVector":"d","sectorType":0},{"exits":{"east":{"direction":1,"desc":"The Immortal Board Room is just to the east.","tags":[],"flag":0,"keyNum":-1,"roomId":1204}},"extra":{"tags":[],"desc":""},"id":1205,"name":"The Post Office Of The Gods","desc":"The Post Office Of The Gods is the same as most Post Offices except that it is not as slow.  Even the Postal service knows not to anger the Gods. Piles of junk mail line the walls.  I guess even Gods get on mailing lists. The Immortal Board Room is to the east.","zoneNum":12,"roomBitVector":"d","sectorType":0},{"exits":{"down":{"direction":5,"desc":"The Immortal Board Room is just down through the floor.  Funny how you","tags":[],"flag":null,"keyNum":null,"roomId":null}},"extra":{"tags":[],"desc":""},"id":1206,"name":"The Social Gathering Room","desc":"This elegantly decorated room has one simple purpose.  To socialize with everyone else around in one central location.","zoneNum":12,"roomBitVector":"d","sectorType":0}]